In [1]:
import sqlite3 as sq
import pandas as pd

In [9]:
data = {'c1':[1,2,3,4],'c2':[10,20,30,40],'c3':[100,200,300,400]}

In [10]:
df = pd.DataFrame(data)

In [11]:
df

   c1  c2   c3
0   1  10  100
1   2  20  200
2   3  30  300
3   4  40  400

In [13]:
con = sq.connect('testDB_Padas.db')

In [15]:
df.to_sql('testDBandPandas',con)

In [17]:
df = pd.read_sql("select * from testDBandPandas", con)

In [18]:
df

   index  c1  c2   c3
0      0   1  10  100
1      1   2  20  200
2      2   3  30  300
3      3   4  40  400

In [20]:
con = sq.connect("test1.db")

In [24]:
df = pd.read_sql("select * from kakao1", con)

In [25]:
df

       Date   Open    High    Low  Closing  Volumn
0  17.06.04  97400  986400  96900    98000  321405
1  17.06.05  97500  986500  96900    98000  321405
2  17.06.06  97500  986600  96900    98000  321405
3  05-06-03    123     456    789     1011       6